/*Во всех заданиях:
1. Реализовать вычисляемые свойства (computed properties)
2. Реализовать пользовательское связывание (custom binding)
3. Симулировать работу с базой если необходимо. Т.е. добавить какие-то исходные данные,
 а все данные необходимые для работы хранить в памяти. НЕ обязательно создавать базу данных.
4. Создайте приложение для новостного агенства. Данное приложение позволяет распространять новости 
в режиме реального времени.
a. Создать категории сообщений
b. Приложение имеет возможность добавления новостного сообщения от пользователя. Множественное добавление новостей.
 Обязательное указание категории.
c. Симулировать сохранения сообщений в локальную базу данных
d. Позволить пользователю выбирать желаемые категории для отображения
e. Реализовать “прослушиватель” новостей
f. Динамически создавать новости раз в несколько секунд на “сервисе”.
g. Новости должны быть показаны для клиента в зависимости от подписки.
h. Возможность быстро выбирать подписки из списка */

import { useDispatch } from 'react-redux';
import React from 'react';
import {BrowserRouter} from 'react-router-dom';
import {useRoutes} from './routes';
import {fetchNews, setNews} from './redux/actions/news';

function App() { 

  const routes = useRoutes();
 
  return (
   <BrowserRouter>
    <div>
      {routes}
    </div>
    </BrowserRouter>  
  );
}

export default App;

